#define		CONFIG_FILE_C
#include "display.h"
#include "configFile.h"
//#pragma CODE_SEG USER_ROM
//#pragma CONST_SEG    DEFAULT
/*************************************************************************
** Application objects 
*************************************************************************/
USR_t_ApplicationObject                 USR_s_OV;
USR_LOAD_STATUS                         USR_LOAD_OV;
USR_t_DeviceConfigrationData            USR_s_DeviceConfigData;
USR_t_ManufactureConfigrationData       USR_s_ManufactureConfigData;


//#pragma CONST_SEG __GPAGE_SEG CONFIG_DATA_SDO
/**********************************开关配置********************************************/
const  STRUCT_SYS_CONFIG SysConfigData@".__CONFIG_DATA"={
0x007b,   // ModuleConfig;//0b00101011;//从第0位到第7位分别为前模块，后模块，中模块，顶模块，配电，高CAN模块  电源管理
7,        //  speedChanelIndex;// = 20;
1,        //  CarSpeedSrc;              
6,        //  engSpeedChanelIndex;// = 20;
1,        //  EngCarSpeedSrc;
2200,     //  SpeedRate;      //2200
8,        //  CycleCaptureNum ;  //8
0,        //  DashBoardSpeedChannel;   //0
1,        // DashBoardEngSpeedChannel ;  //0
0x038e,0x0341,0x0341,0x0343,0, //  UserReserve[100];
0,  //startLogoTime
0, //pwm_load_out
1,  //post
0,0,0,
1,

};
/*******************************************************************************
* note by ap . 2016/3/24
* @brief:	物理开关配置
*		KeySwitchConfig[7]
*			1 高有效 ，0 低有效
*		KeyStyleConfig[14]: 两位表示
*			0x00 LOW_ONLY
*			0x02 HIGH_ONLY
*			0x03 HIGH_LOW
*		KeyDefaultValue[7]
*		UserReserve[46]
********************************************************************************/
const  STRUCT_KEY_CONFIG  UserKeyConfig@".__CONFIG_DATA"=
{
	{ 0xc8,0x8b,0x00,0x00,0x37,0x00}, // KeySwitchConfig  1->高有效   0->低有效
	// 00->olny low  11->only  high  10->low high
	// jb11 jb9 jb7 jb5    jb19 jb17 jb15 jb13   jb14 jb16 jb18 jb20   jb6,jb8,jb10 jb12   
	{ 0xEA,          0xAA,          0xab,           0xea,        
	// ja15 ja17 ja27 ja25   //ja22 ja24 ja26 ja28   ja14 j16 ja18 ja20   jb3 jb1 jc10 jb4  (wu)    
	0xaa,            0xaa ,        0xaa,           0,             
	// jc8 jc16 jc12 jc14    jc2 jc4 jc6
	0xaf,        0xa,             0,           0}, //KeyStyleConfig   
	{ 0x00,0x00,0x00,0x00,0x00,0x00}//
};

//const  OPENSHOAR  OpenMask@".__CONFIG_DATA"  = {0};//= 0x00;
//const  OPENSHOAR  ShortMask@".__CONFIG_DATA" = {0};//= 0x00;
const  OPENSHOAR  OpenShortMask@".__CONFIG_DATA";

/********************************传感器配置********************************************/
const  INSIDE_16BIT_ATTR_STRUCT Inside16BitAttrConfig[SENSOR_DASHBOARD_NUM] @".__CONFIG_DATA" = 
{                                                              //KEY
    {0x80,135,5,10,0,48,20,114,60,145,80,180,120,0,0,0},
    {0x80,135,5,10,0,48,20,114,60,145,80,180,120,0,0,0},
    {0x80,135,5,0,0,45,20,75,40,100,75,200,100,0,0,2},
    //{0x80,135,5,0,0,45,20,75,40,100,75,200,100,0,0,3},   
   // {0x80,135,5,0,0,45,20,75,40,100,75,200,100,0,0,4}, 

	{0x81,100,6,  5,0,   12,20,   18,40,   25,60,  32,80,38,100,3},   
       {0x81,100,6,  5,0,   12,20,   18,40,   25,60,  32,80,38,100,4}, 
      
};
const  SENSOR_DATA_STRUCT  SENSOR_DATA_CONFIG[INSIDE_16BIT_DATA_NUM]@".__CONFIG_DATA"=
{ 
  0xc8,0x00,0x0001,  //仪表传感器一  0  
  0xc8,0x00,0x0001,  //仪表传感器二  1      
  0xc8,0x00,0x0001,  //仪表传感器三  2      
  0xc8,0x00,0x0001,  //仪表传感器四  3  
  0xc8,0x00,0x0001,  //仪表传感器五  4    
  0xc8,40,  0x0001,  //仪表板温      5
  0xc8,0x00,0x1001,  //电池电压      6
  0xc8,0x00,0x0001,  //车速          7
  0xc8,0x00,0x0001,  //转速          8
  0xc8,0x00,0x0001,  //请求包序列号  9       
  0x00,0x00,0x0000,  //              10     
  0x00,0x00,0x0000,  //              11
  0x00,0x00,0x0000,  //              12
  0x00,0x00,0x0000,  //              13
  0x00,0x00,0x0000,  //              14
  0x00,0x00,0x0000,  //              15
  0x00,0x00,0x0000,  //              16
  0x00,0x00,0x0000,  //              17
  0x00,0x00,0x0000,  //              18   InsideData[18] =   SysConfigData.SpeedRate; 
  0x00,0x00,0x0000,  //              19   InsideData[19]=   SysConfigData.CycleCaptureNum; 
  
  /**************************************************/    
  0xc8,0x00,0x0001,  //前驱传感器一  20   取消
  0xc8,0x00,0x0001,  //前驱传感器二  21   取消    
  0xc8,0x00,0x0001,  //前驱传感器三  22   取消     
  0xc8,0x00,0x0001,  //前驱传感器四  23   取消  
  0xc8,0x00,0x0001,  //前驱传感器五  24   取消   
  0xc8,0x00,0x0001,  //前驱传感器六  25   取消 
  0xc8,0x00,0x0001,  //前驱传感器七  26   取消 
  0xc8,0x00,0x0001,  //前驱传感器八  27   取消 
  0xc8,40,0x0001,    //温度          28   
  0xc8,0x00,0x0001,  //              29  
  0x00,0x00,0x0000,  //              30
  0x00,0x00,0x0000,  //              31
  0x00,0x00,0x0000,  //              32
  0x00,0x00,0x0000,  //              33
  0x00,0x00,0x0000,  //              34
  0x00,0x00,0x0000,  //              35
  0x00,0x00,0x0000,  //              36
  0x00,0x00,0x0000,  //              37
  0x00,0x00,0x0000,  //              38
  0x00,0x00,0x0000,  //              39
 /**************************************************/ 
  0xc8,0x00,0x0001,  //后驱传感器一  40   油量传感器
  0xc8,0x00,0x0001,  //后驱传感器二  41   前气压传感器   
  0xc8,0x00,0x0001,  //后驱传感器三  42   后气压传感器
  0xc8,0x00,0x2001,  //后驱传感器四  43   机油压力传感器
  0xc8,0x00,0x0001,  //后驱传感器五  44   水温传感器 
  0xc8,0x00,0x0001,  //后驱传感器六  45   取消
  0xc8,0x00,0x0002,  //后驱传感器七  46   取消
  0xc8,0x00,0x0001,  //后驱传感器八  47   取消
  0xc8,40,0x0001,    //温度          48  
  0xc8,0x00,0x0002,  //              49
  0x00,0x00,0x0000,  //              50
  0x00,0x00,0x0000,  //              51
  0x00,0x00,0x0000,  //              52
  0x00,0x00,0x0000,  //              53
  0x00,0x00,0x0000,  //              54
  0x00,0x00,0x0000,  //              55
  0x00,0x00,0x0000,  //              56
  0x00,0x00,0x0000,  //              57
  0x00,0x00,0x0000,  //              58
  0x00,0x00,0x0000,  //              59
 /**************************************************/    
  0xc8,0x00,0x0001,  //中驱传感器一  60   取消 
  0xc8,0x00,0x0001,  //中驱传感器二  61   取消    
  0xc8,0x00,0x0001,  //中驱传感器三  62   取消     
  0xc8,0x00,0x0001,  //中驱传感器四  63   取消 
  0xc8,0x00,0x0001,  //中驱传感器五  64   取消  
  0xc8,40,  0x0001,  //中驱传感器六  65   取消 
  0xc8,0x00,0x0002,  //中驱传感器七  66   取消 
  0xc8,0x00,0x0001,  //中驱传感器八  67   取消 
  0xc8,40,0x0001,    //温度          68   取消 
  0xc8,0x00,0x0002,  //              69   取消 
  0x00,0x00,0x0000,  //              70
  0x00,0x00,0x0000,  //              71
  0x00,0x00,0x0000,  //              72
  0x00,0x00,0x0000,  //              73
  0x00,0x00,0x0000,  //              74
  0x00,0x00,0x0000,  //              75
  0x00,0x00,0x0000,  //              76
  0x00,0x00,0x0000,  //              77
  0x00,0x00,0x0000,  //              78
  0x00,0x00,0x0000,  //              79
 /**************************************************/ 
  0xc8,0x00,0x1001,  //顶驱传感器一  80   取消 
  0xc8,0x00,0x1001,  //顶驱传感器二  81   取消     
  0xc8,0x00,0x0001,  //顶驱传感器三  82   取消     
  0xc8,0x00,0x0001,  //顶驱传感器四  83   取消 
  0xc8,0x00,0x0001,  //顶驱传感器五  84   取消   
  0xc8,40,  0x0001,  //顶驱传感器六  85   取消 
  0xc8,0x00,0x0002,  //顶驱传感器七  86   取消 
  0xc8,0x00,0x0001,  //顶驱传感器八  87   取消 
  0xc8,40,0x0001,    //温度          88   取消 
  0xc8,0x00,0x0002,  //              89   取消 
  0x00,0x00,0x0000,  //              90
  0x00,0x00,0x0000,  //              91
  0x00,0x00,0x0000,  //              92
  0x00,0x00,0x0000,  //              93
  0x00,0x00,0x0000,  //              94
  0x00,0x00,0x0000,  //              95
  0x00,0x00,0x0000,  //              96
  0x00,0x00,0x0000,  //              97
  0x00,0x00,0x0000,  //              98
  0x00,0x00,0x0000,  //              99
  /************************************************/
  0x00,0x00,0x0000,  // 配电         100
  0x00,0x00,0x0000,  //              101
  0x00,0x00,0x0000,  //              102
  0x00,0x00,0x0000,  //              103
  0x00,0x00,0x0000,  //              104
  0x00,0x00,0x0000,  //              105
  0x00,0x00,0x0000,  //              106
  0x00,0x00,0x0000,  //              107
  0x00,0x00,0x0000,  //              108
  0x00,0x00,0x0000,  //              109
  /***********************************************/
  0xc8,0x00,0x2001,  // 电源管理     110
  0xc8,0x00,0x0001,  //              111
  0xc8,0x00,0x0001,  //              112
  0xc8,0x00,0x0001,  //              113
  0xc8,0x00,0x0001,  //              114
  0xc8,0x00,0x0001,  //              115
  0xc8,0x00,0x0001,  //              116
  0xc8,0x00,0x0001,  //              117
  0xc8,0x00,0x0001,  //              118
  0xc8,0x00,0x0001,  //              119  
  0xc8,0x00,0x0001,  //              120
  0xc8,0x00,0x0001,  //              121
  0xc8,0x00,0x0001,  //              122
  0xc8,0x00,0x0001,  //              123
  0xc8,0x00,0x0001,  //              124
  0xc8,0x00,0x0001,  //              125
  0xc8,0x00,0x0001,  //              126
  0x00,0x00,0x0001,  //              127
  0x00,0x00,0x0001,  //              128
  0x00,0x00,0x0001,  //              129
  0x00,0x00,0x0001,  //              130
  0x00,0x00,0x0001,  //              131
  0x00,0x00,0x0001,  //              132
  0x00,0x00,0x0001,  //              133
  0x00,0x00,0x0001,  //              134
  0x00,0x00,0x0001,  //              135
  0x00,0x00,0x0001,  //              136
  0x00,0x00,0x0001,  //              137
  0x00,0x00,0x0001,  //              138
  0x00,0x00,0x0001,  //              139
  
};
const  SENSOR_VIRTUAL_KEY_STRUCT   SENSOR_VIRTUAL_KEY_CONFIG[SENSOR_VIRTUAL_KEY_NUM]@".__CONFIG_DATA"= 
{
  0xE0,0,0,0xfe,0xfe,10,21,
  0xE0,0,0,0xfe,0xfe,11,22,
 //2,0x80,75,100,12,
 //3,0x80,75,100,13,
 //4,0x80,75,100,14,
};

 //attribute.7 == 1:为虚拟开关。 attribute.5_6 == 00:低报警 。10:两端报警  01:中间报警 11：高报警
 // bit4=1 大端模式   1->高在前   0->低在前
 // bit3=1是否有效 bit2= 位状态    
 //offset 1 = 有符号    2-add  3-sub
 //bitValue e>> f<<
const  J1939_NUMBER J1939_Number_Config@".__CONFIG_DATA"=
{
  0,    // #define J1939_OFFSET_BYTE 
  3,    //#define J1939_STATUS_NUMBER      //
  3,    // #define J1939_CHAR_NUMBER       //
  3,    //#define J1939_INT_NUMBER         //
  2,    // #define J1939_WORD_NUMBER
  0,     //J1939_STRING_NUMBER
};
const  J1939_FIND_INDEX_STRUCT J1939FindIndexConfig[200] @".__CONFIG_DATA"= 
{
  0x10ffff01,0,  3, 
  0x18fEEE03,3,  3, 
  0x0cf00402,6,  3, 
 // 0x10f00302,7,  2, 
  0x10ffff04,9,  2, 
  
} ;
const  UINT16 J1939IndexConfig[J1939WordDataNum] @".__CONFIG_DATA"= 
{
  // 0,3,6,1,4,7,9,2,5,8,10,
  0,1,2,3,4,5,6,7,8,9,10,
};
   
const  J1939_WORD_DATA_STRUCT   J1939WordDataConfig[J1939WordDataNum] @".__CONFIG_DATA"=    //LCD_J1939_类型
{                   

/******************************状态量************************************/  //1 byte
                     //起始位   位长度       codekey
    {/*0x12345678,*/0,  0,          2,  0xc000,0,0, 1, 0,       3         },        //500
    {/*0x12345678,*/1,  4,          3,  0x8000,0,0,3, 0,        1         }, 
    {/*0x12345678,*/0,  0,          4,  0x8000,0,0, 2, 0,       2         },
 /****************************char*****************************************/ //1 byte
    {/*0x12345678,*/0, 40, 0x10000001,  0xe021, 0,0,8, 80,      9         },   //520
    {/*0x12345678,*/1,  0,          1,  0x8011, 0,0,45,100,     4         }, 
    {/*0x12345678,*/2,  0,          1,  0x8021, 0,0,45,100,     5         }, 
 /**************************int*******************************************/ 
    {/*0x12345678,*/0,  0,          1,  0x8002, 0,0,45, 100,    16        },  //540   int
    {/*0x12345678,*/2,  0,          1,  0x8012, 0,0,100,3000,   17        }, 
    {/*0x12345678,*/4,  0,          1,  0x8022, 0,0,100,300,    18        }, 
/******************************word******************************************/
    {/*0x12345678,*/0,  0,          1,  0x8003, 0,0,45,100,     24        },   //60 word
    {/*0x12345678,*/4,  0,          1,  0x8014, 0,0,100,3000,   25        }, 
 /*************************************************************************/      
};
const  STATUS_STRUCT  StatusPrara[80]@".__CONFIG_DATA"=
{ 
  {0x00,0x03,0x00,0x00,0x00,0x00,0x00,0x00}, //1-
  {0x03,0x02,0x01,0x00,0x00,0x00,0x00,0x00},
  {0x02,0x01,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
  {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},
};


/*typedef struct
{
    UINT8   type;       //参数类型  
    UINT16  Index;      //参数的索引
    UINT16  rang;       //量程，例如：车速量程为140，转速量程为3000
                       //            油量量程为100（扩大100倍）
                       //            气压量程为100（扩大10倍）
    UINT16 maxStep;    //电机总步数，1、2、3、4号电机为1080
                       //            5、6号电机为2900
    UINT8 filterGear;
    UINT16 minScale;      //偏移量 即零刻度的值为多少。例如：水温为40
                          //车速为0
    UINT8 KeyIndex;  
    
    
}MOTO_STEP_STRUCT;*/
const MOTO_STEP_STRUCT  MotorStepPrm[6]@".__CONFIG_DATA" = 
{ 
    {1,0,  120, 12,0,5,0},   //后气压
    {1,1,  120, 12,0,6,0},   //前气压                                       
    {1,2,   80,  1080,0,0,0},    //水温
    {1,20,  100, 1080,0,0,0},    //油量
    {1,7,   140, 2900,0,0,10},   //车速
    {1,8,   3500,2900,0,0,6},     //转速
};


/*
#define	DIAGNOSE_BEI_YONG	    	0///备用
#define	DIAGNOSE_LOAD			    	1///负载
#define	DIAGNOSE_SWITCH		    	2///开关
#define	DIAGNOSE_SENSOR			    3///传感器
#define	DIAGNOSE_CATCH		    	4///捕获信号
#define	DIAGNOSE_ENABLE_UNABLE	5///显示空格   
                                6//常亮                        
*/
const  DIAGNOSE_STRUCT  ModuleDiagnose@".__CONFIG_DATA"=
{ 
/******************************************************************************************************
仪表诊断配置数据
******************************************************************************************************/
  { 
    0x11,/*" J A 0 1  负载                     J A 0 2  负载                     "}*/
    0x00,/*" J A 1 1  内部can终端电阻          J A 1 3  PWM 输出                 "}*/
    0x22,/*" J A 1 4  开关                     J A 1 5  开关                     "}*/
    0x22,/*" J A 1 6  开关                     J A 1 7  开关                     "}*/
    0x20,/*" J A 1 8  开关                     J A 1 9  终端电阻                 "}*/
    0x22,/*" J A 2 0  开关                     J A 2 2  开关                     "}*/
    0x02,/*" J A 2 3  PWM输出                  J A 2 4  开关                     "}*/
    0x22,/*" J A 2 5  开关                     J A 2 6  开关                     "}*/
    0x22,/*" J A 2 7  开关                     J A 2 8  开关                     "}*/
    0x22,/*" J B 0 1  开关                     J B 0 3  开关                     "}*/
    0x22,/*" J B 0 4  开关                     J B 0 5  开关                     "}*/
    0x22,/*" J B 0 6  开关                     J B 0 7  开关                     "}*/
    0x22,/*" J B 0 8  开关                     J B 0 9  开关                     "}*/
    0x22,/*" J B 1 0  开关                     J B 1 1  开关                     "}*/
    0x22,/*" J B 1 2  开关                     J B 1 3  开关                     "}*/
    0x22,/*" J B 1 4  开关                     J B 1 5  开关                     "}*/
    0x22,/*" J B 1 6  开关                     J B 1 7  开关                     "}*/
    0x22,/*" J B 1 8  开关                     J B 1 9  开关                     "}*/
    0x20,/*" J B 2 0  开关                     J C 0 1  +12v输出                 "}*/
    0x20,/*" J C 0 2  开关                     J C 0 3  转速信号pwm              "}*/
    0x20,/*" J C 0 4  开关                     J C 0 5  车速信号pwm              "}*/
    0x23,/*" J C 0 6  开关                     J C 0 7  传感器                   "}*/
    0x23,/*" J C 0 8  开关                     J C 0 9  传感器                   "}*/
    0x23,/*" J C 1 0  开关                     J C 1 1  传感器                   "}*/
    0x23,/*" J C 1 2  开关                     J C 1 3  传感器                   "}*/
    0x23,/*" J C 1 4  开关                     J C 1 5  传感器                   "}*/
    0x23,/*" J C 1 6  开关                                                       "}*/  
 }, 
/******************************************************************************************************
前驱诊断配置数据
******************************************************************************************************/
 {
    0x11,/*" J A 0 1  负载 O16                 J A 0 2  负载 O17                "}*/
    0x11,/*" J A 0 3  负载 O15                 J A 0 7  负载 O14                "}*/
    0x11,/*" J A 0 8  负载 O2                  J A 1 0  负载 O3                 "}*/
    0x21,/*" J A 1 2  开关 I17                 J A 1 3  负载 O0                 "}*/
    0x11,/*" J A 1 4  负载 O1                  J A 1 5  负载 04                 "}*/
    0x12,/*" J A 1 6  负载 O5                  J A 1 7  开关 I0                 "}*/
    0x22,/*" J A 1 8  开关 I1                  J A 1 9  开关 I2                 "}*/
    0x22,/*" J A 2 0  开关 I3                  J A 2 1  开关 I13                "}*/
    0x22,/*" J A 2 2  开关 I14                 J A 2 3  开关 I04                "}*/
    0x23,/*" J A 2 4  开关 I05                 J A 2 5  传感器                  "}*/
    0x33,/*" J A 2 6  传感器                   J A 2 7  传感器                  "}*/
    0x33,/*" J A 2 8  传感器                   J A 2 9  传感器                  "}*/
    0x33,/*" J A 3 0  传感器                   J A 3 1  电压传感器              "}*/
    0x32,/*" J A 3 2  电压传感器               J A 3 3  开关 I06                "}*/
    0x11,/*" J A 3 7  负载 O6                  J A 3 8  负载 O7                 "}*/
    0x11,/*" J A 3 9  负载 O8                  J A 4 0  负载 O9                 "}*/
    0x22,/*" J A 4 1  开关 I7                  J A 4 2  开关 I08                "}*/
    0x22,/*" J A 4 3  开关 I09                 J A 4 4  开关 I10                "}*/
    0x22,/*" J A 4 5  开关 I11                 J A 4 6  开关 I12                "}*/
    0x22,/*" J A 4 7  开关 I15                 J A 4 8  开关 I16                "}*/
    0x11,/*" J A 4 9  负载 O10                 J A 5 0  负载 O11                "}*/
    0x11,/*" J A 5 1  负载 O12                 J A 5 2  负载 O13                "}*/
 // 0x00,/*" J A 5 3  地址1                    J A 5 4  地址2                   "}*/
    0x00,/*" J A 5 5  车速                     J A 5 6  转速                    "}*/
    0x01,/*" J A 5 7  +12                      J A 5 8  负载 O19                "}*/
    0x10,/*" J A 5 9  负载 O18                 J A 6 0  备用                    "}*/
 },
/******************************************************************************************************
后驱诊断配置数据
******************************************************************************************************/
  {
    0x11,/*" J A 0 1  负载 O16                 J A 0 2  负载 O17                "}*/
    0x11,/*" J A 0 3  负载 O15                 J A 0 7  负载 O14                "}*/
    0x11,/*" J A 0 8  负载 O2                  J A 1 0  负载 O3                 "}*/
    0x21,/*" J A 1 2  开关 I17                 J A 1 3  负载 O0                 "}*/
    0x11,/*" J A 1 4  负载 O1                  J A 1 5  负载 04                 "}*/
    0x12,/*" J A 1 6  负载 O5                  J A 1 7  开关 I0                 "}*/
    0x22,/*" J A 1 8  开关 I1                  J A 1 9  开关 I2                 "}*/
    0x22,/*" J A 2 0  开关 I3                  J A 2 1  开关 I13                "}*/
    0x22,/*" J A 2 2  开关 I14                 J A 2 3  开关 I04                "}*/
    0x23,/*" J A 2 4  开关 I05                 J A 2 5  传感器                  "}*/
    0x33,/*" J A 2 6  传感器                   J A 2 7  传感器                  "}*/
    0x33,/*" J A 2 8  传感器                   J A 2 9  传感器                  "}*/
    0x33,/*" J A 3 0  传感器                   J A 3 1  电压传感器              "}*/
    0x32,/*" J A 3 2  电压传感器               J A 3 3  开关 I06                "}*/
    0x11,/*" J A 3 7  负载 O6                  J A 3 8  负载 O7                 "}*/
    0x11,/*" J A 3 9  负载 O8                  J A 4 0  负载 O9                 "}*/
    0x22,/*" J A 4 1  开关 I7                  J A 4 2  开关 I08                "}*/
    0x22,/*" J A 4 3  开关 I09                 J A 4 4  开关 I10                "}*/
    0x22,/*" J A 4 5  开关 I11                 J A 4 6  开关 I12                "}*/
    0x22,/*" J A 4 7  开关 I15                 J A 4 8  开关 I16                "}*/
    0x11,/*" J A 4 9  负载 O10                 J A 5 0  负载 O11                "}*/
    0x11,/*" J A 5 1  负载 O12                 J A 5 2  负载 O13                "}*/
 // 0x00,/*" J A 5 3  地址1                    J A 5 4  地址2                   "}*/
    0x00,/*" J A 5 5  车速                     J A 5 6  转速                    "}*/
    0x01,/*" J A 5 7  +12                      J A 5 8  负载 O19                "}*/
    0x10,/*" J A 5 9  负载 O18                 J A 6 0  备用                    "}*/
 },
 /******************************************************************************************************
中驱诊断配置数据
******************************************************************************************************/
  {
    0x11,/*" J A 0 1  负载 O16                 J A 0 2  负载 O17                "}*/
    0x11,/*" J A 0 3  负载 O15                 J A 0 7  负载 O14                "}*/
    0x11,/*" J A 0 8  负载 O2                  J A 1 0  负载 O3                 "}*/
    0x21,/*" J A 1 2  开关 I17                 J A 1 3  负载 O0                 "}*/
    0x11,/*" J A 1 4  负载 O1                  J A 1 5  负载 04                 "}*/
    0x12,/*" J A 1 6  负载 O5                  J A 1 7  开关 I0                 "}*/
    0x22,/*" J A 1 8  开关 I1                  J A 1 9  开关 I2                 "}*/
    0x22,/*" J A 2 0  开关 I3                  J A 2 1  开关 I13                "}*/
    0x22,/*" J A 2 2  开关 I14                 J A 2 3  开关 I04                "}*/
    0x23,/*" J A 2 4  开关 I05                 J A 2 5  传感器                  "}*/
    0x33,/*" J A 2 6  传感器                   J A 2 7  传感器                  "}*/
    0x33,/*" J A 2 8  传感器                   J A 2 9  传感器                  "}*/
    0x33,/*" J A 3 0  传感器                   J A 3 1  电压传感器              "}*/
    0x32,/*" J A 3 2  电压传感器               J A 3 3  开关 I06                "}*/
    0x11,/*" J A 3 7  负载 O6                  J A 3 8  负载 O7                 "}*/
    0x11,/*" J A 3 9  负载 O8                  J A 4 0  负载 O9                 "}*/
    0x22,/*" J A 4 1  开关 I7                  J A 4 2  开关 I08                "}*/
    0x22,/*" J A 4 3  开关 I09                 J A 4 4  开关 I10                "}*/
    0x22,/*" J A 4 5  开关 I11                 J A 4 6  开关 I12                "}*/
    0x22,/*" J A 4 7  开关 I15                 J A 4 8  开关 I16                "}*/
    0x11,/*" J A 4 9  负载 O10                 J A 5 0  负载 O11                "}*/
    0x11,/*" J A 5 1  负载 O12                 J A 5 2  负载 O13                "}*/
 // 0x00,/*" J A 5 3  地址1                    J A 5 4  地址2                   "}*/
    0x00,/*" J A 5 5  车速                     J A 5 6  转速                    "}*/
    0x01,/*" J A 5 7  +12                      J A 5 8  负载 O19                "}*/
    0x10,/*" J A 5 9  负载 O18                 J A 6 0  备用                    "}*/
 },
 /******************************************************************************************************
顶驱诊断配置数据
******************************************************************************************************/
  {
    0x11,/*" J A 0 1  负载 O16                 J A 0 2  负载 O17                "}*/
    0x11,/*" J A 0 3  负载 O15                 J A 0 7  负载 O14                "}*/
    0x11,/*" J A 0 8  负载 O2                  J A 1 0  负载 O3                 "}*/
    0x21,/*" J A 1 2  开关 I17                 J A 1 3  负载 O0                 "}*/
    0x11,/*" J A 1 4  负载 O1                  J A 1 5  负载 04                 "}*/
    0x12,/*" J A 1 6  负载 O5                  J A 1 7  开关 I0                 "}*/
    0x22,/*" J A 1 8  开关 I1                  J A 1 9  开关 I2                 "}*/
    0x22,/*" J A 2 0  开关 I3                  J A 2 1  开关 I13                "}*/
    0x22,/*" J A 2 2  开关 I14                 J A 2 3  开关 I04                "}*/
    0x23,/*" J A 2 4  开关 I05                 J A 2 5  传感器                  "}*/
    0x33,/*" J A 2 6  传感器                   J A 2 7  传感器                  "}*/
    0x33,/*" J A 2 8  传感器                   J A 2 9  传感器                  "}*/
    0x33,/*" J A 3 0  传感器                   J A 3 1  电压传感器              "}*/
    0x32,/*" J A 3 2  电压传感器               J A 3 3  开关 I06                "}*/
    0x11,/*" J A 3 7  负载 O6                  J A 3 8  负载 O7                 "}*/
    0x11,/*" J A 3 9  负载 O8                  J A 4 0  负载 O9                 "}*/
    0x22,/*" J A 4 1  开关 I7                  J A 4 2  开关 I08                "}*/
    0x22,/*" J A 4 3  开关 I09                 J A 4 4  开关 I10                "}*/
    0x22,/*" J A 4 5  开关 I11                 J A 4 6  开关 I12                "}*/
    0x22,/*" J A 4 7  开关 I15                 J A 4 8  开关 I16                "}*/
    0x11,/*" J A 4 9  负载 O10                 J A 5 0  负载 O11                "}*/
    0x11,/*" J A 5 1  负载 O12                 J A 5 2  负载 O13                "}*/
 // 0x00,/*" J A 5 3  地址1                    J A 5 4  地址2                   "}*/
    0x00,/*" J A 5 5  车速                     J A 5 6  转速                    "}*/
    0x01,/*" J A 5 7  +12                      J A 5 8  负载 O19                "}*/
    0x10,/*" J A 5 9  负载 O18                 J A 6 0  备用                    "}*/
 },
 /******************************************************************************************************
配电诊断配置数据
******************************************************************************************************/ 
 {
    0x11,/*" J A 0 1  路牌灯                   J A 0 4  路牌灯                "}*/
    0x11,/*" J A 1 4  投币翻板电磁阀           J A 1 6  洗涤器                "}*/
    0x11,/*" J A 1 7  司机灯                   J A 1 8  前门踏步灯            "}*/
    0x11,/*" J A 1 9  前位置灯                 J A 2 0  中门关开电磁阀        "}*/
    0x11,/*" J A 2 1  左前转向灯               J A 2 2  右前转向灯            "}*/
    0x11,/*" J A 2 3  移动电视电源 1           J A 2 4  前门开电磁阀          "}*/
    0x11,/*" J A 2 7  备用传感器               J A 2 8  备用传感器            "}*/
    0x11,/*" J A 2 9  备用传感器               J A 3 0  备用传感器            "}*/
    0x11,/*" J A 3 1  备用传感器               J A 3 2  备用传感器            "}*/
    0x11,/*" J A 3 3  备用 A C C               J A 3 4  备用 O N              "}*/
    0x15,/*" J A 3 5  备用起动开关             J A 3 6  备用危急警告开关      "}*/
    0x55,/*" J A 3 7  近光灯开关               J A 3 8  远光灯开关            "}*/
    0x55,/*" J A 3 9  左前雾灯                 J A 4 0  顶示廊灯              "}*/
    0x11,/*" J A 4 1  缓速器工作指示           J A 4 2  前门开信号            "}*/
    0x11,/*" J A 4 3  中门开信号               J A 4 4  喇叭开关              "}*/
    0x11,/*" J A 4 5  备用开关                 J A 4 6  备用开关              "}*/
    0x11,/*" J A 4 7  备用开关                 J A 4 8  备用                  "}*/
    0x11,/*" J A 4 9  前门电磁阀               J A 5 0  前门电磁阀            "}*/
    0x11,/*" J A 5 1  右前雾灯                 J A 5 2  右前雾灯              "}*/
    0x11,/*" J A 5 3  室内灯 1                 J A 5 4  室内灯 1              "}*/
    0x11,/*" J A 5 5  室内灯 2                 J A 5 6  室内灯 2              "}*/ 
    0x11,/*" J A 5 7  备用                     J A 5 8  备用                  "}*/ 
    0x25,/*" J A 5 9  开关                    J A 6 0   C A N - R             "}*/
    0x55,/*" J A 6 2   C A N - L               J A 6 3   C A N - H            "}*/
    0x55,/*" J A 3 7  近光灯开关               J A 3 8  远光灯开关            "}*/
    0x55,/*" J A 3 9  左前雾灯                 J A 4 0  顶示廊灯              "}*/
 },
/******************************************************************************************************
电源管理诊断配置数据
******************************************************************************************************/
 
 {
    0x11,/*" J A 0 1  路牌灯                   J A 0 4  路牌灯                "}*/
    0x13,/*" J A 1 4  投币翻板电磁阀           J A 1 6  洗涤器                "}*/
    0x13,/*" J A 1 7  司机灯                   J A 1 8  前门踏步灯            "}*/
    0x13,/*" J A 1 9  前位置灯                 J A 2 0  中门关开电磁阀        "}*/
    0x12,/*" J A 2 1  左前转向灯               J A 2 2  右前转向灯            "}*/
    0x22,/*" J A 2 3  移动电视电源 1           J A 2 4  前门开电磁阀          "}*/
    0x22,/*" J A 2 7  备用传感器               J A 2 8  备用传感器            "}*/
    0x11,/*" J A 2 9  备用传感器               J A 3 0  备用传感器            "}*/
    0x11,/*" J A 3 1  备用传感器               J A 3 2  备用传感器            "}*/
    0x11,/*" J A 3 3  备用 A C C               J A 3 4  备用 O N              "}*/
    0x11,/*" J A 3 5  备用起动开关             J A 3 6  备用危急警告开关      "}*/
    0x11,/*" J A 3 7  近光灯开关               J A 3 8  远光灯开关            "}*/
    0x55,/*" J A 3 9  左前雾灯                 J A 4 0  顶示廊灯              "}*/
 }
};

/*
typedef struct 
{
 UINT8 DashboardIcoWarn[100];
 UINT8 DashDriverIcoWarn[4];
 UINT8 DashSensorIcoWarn[6];
 UINT8 FrontDriverIcoWarn[20];
 UINT8 FrontSensorIcoWarn[8];
 UINT8 BackDriverIcoWarn[20];
 UINT8 BackSensorIcoWarn[8];
 UINT8 MiddleDriverIcoWarn[20];
 UINT8 MiddleSensorIcoWarn[8];
 UINT8 TopDriverIcoWarn[20];
 UINT8 TopSensorIcoWarn[8];
 UINT8 PowerDriverIcoWarn[18];
 UINT8 PowerFuseIcoWarn[17];
 UINT8 PowerContorolIcoWarn[16]; 
 UINT8 PowerContorolSensorIcoWarn[3];
 UINT8 UserReserve[24]; 
}
*/
const  SIcoWarnConfig IcoWarnConfig @".__CONFIG_DATA"=           //EB82DF     EB83CF 
{ 
  {
    0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
 },  
 {
    0x0b,0x0a,0x00,0x00,
  }, 
  {
    0x08,0x08,0x00,0x00,0x00,
  } ,
  {
   0x09,0x0a,0x0b,0x09,
  }, 
  {
    0x08,0x08,0x00,0x00,0x00,
  }
    
};


const  ID_Time_INFO J1939ZFFindIndexConfig[20]@".__CONFIG_DATA"= 
{

 //发送ID    模式  周期  条码索引 条目数
  0x10ffff01, 0,   200,   0,       2 , 
  //0x18fEEE03, 0,   200,   2,       2 , 
};
                                      //00 22 02 18 28
/*
   UINT16  mode;       //高4位来源模式     1->j1939  2->内部数据  3->chugangqi   
                       //低四位转化表模式  0->无     1->状态查表  2->y=ax+b 模式
 UINT8  tableIndex;    //转化表索引
 UINT16 srcTypeIndex;  //j1939 数据来源索引   内部数据选择+索引        传感器来源索引
 UINT8  srcbitIndex;   //j1939起始位              -                    传感器起始位
 UINT8  srcbitLenght;  //j1939位长             数据长度                传感器数据长度
                                                                     
 UINT8  dstbyteIndex;    //字节索引
 UINT8  dstbitIndex;     //起始位
 UINT8  dstbitLenght;    //位长

*/

const  J1939_DBT_INFO J1939ZFDataConfig@".__CONFIG_DATA"=//nbapo:配置数据CAN发送_帧
{ 
  0x040,0x00,0x03,0x04,0x04,0x05,0x06,0x07, //0
	0x050,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07, //9
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07, //10
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
	0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07, //19
	0x1002,0x8005, //0
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000, //9
	0x0001,0x0000, //10
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000, //19
	0x1002,0x8005, //0
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000, //9
	0x0001,0x0000, //10
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000, //19
	0x1002,0x8005, //0
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000,
	0x0001,0x0000, //9
/*
 UINT16  mode;         //高4位来源模式     1->j1939  2->内部数据  3->chugangqi  低四位转化表模式  0->无     1->状态查表  2->y=ax+b 模式
 UINT8  tableIndex;    //转化表索引
 UINT16 srcTypeIndex;  //j1939 数据来源索引   内部数据选择+索引        传感器来源索引
 UINT8  srcbitIndex;   //j1939起始位              -                    传感器起始位
 UINT8  srcbitLenght;  //j1939位长             数据长度                传感器数据长度                                                                  
 UINT8  dstbyteIndex;  //字节索引
 UINT8  dstbitIndex;   //起始位
 UINT8  dstbitLenght;  //位长
 */
	//mode tableIndex srcTypeIndex srcbitIndex srcbitLenght 
	//dstbyteIndex dstbitIndex dstbitLenght
	
	0x0020,0x00,0x1f00,0x00,0x04,    6,2,4,
	0x0030,0x00,0x0001,0x00,0x10,    0,0,16,
		
	0x0020,0x00,0x1f00,0x00,0x04,    6,2,4,
	0x0030,0x00,0x0000,0x00,0x10,    0,0,16,
	
		
	0x0010,0x00,0x0000,0x00,0x00,    0x01,0x00,8,
	0x0010,0x00,0x0000,0x00,0x00,    0x02,0x00,8,

	
	0x0021,0x00,0x1f00,0x00,0x10,    0x03,0x00,2,
	0x0021,0x00,0x1f01,0x10,0x10,    0x03,0x02,2,
	0x0021,0x00,0x1f02,0x20,0x10,    0x03,0x04,2,
	0x0021,0x00,0x1f03,0x00,0x10,    0x03,0x06,2,
};         
         

/*
typedef struct
{
 UINT16 logic[24];  //bit15=1有效   bit14=1('|')  bit14=0('&')   bit13=1(~)
 UINT16 outPutTypeAndSeconds;
 UINT16 port;
}
LOAD_CONDITIONS_STRUCT;

*/
//24*16*2=768bytes
/*******************************************************************************
* note by ap,2016/3/24
* @brief: 		[0]~[22]：	处理逻辑	
*								b15 : 逻辑有效位
*								b14 : 与、或逻辑位。1：或
*								b13 : 非
*								b12-0: 
*										b12-9 : 模块ID	
*											1 仪表
*											……
*										b8-0 : 
*											b8 == 0 为物理开关，b8==1 为虚拟开关
*											b7-0 索引号
*				[23]:		低8位负载索引
*							bit10-8: 时间单位
*									0：
*									1 : 秒
*									2 : 分
*									3 : 时
*									4 : 50ms 
*							bit15-11:功能
*									0x01 负载正常输出
*									0x02 延时断电
*									0x03 闪烁
*									0x04 延时输出
*									……
*									
*				[24]:		时间：高8位，低8位		
*				[25]:		负载转虚拟开关索引
*								高8位：类型
*								低8位：索引值
*******************************************************************************/
UINT16 ROMCONST  LoadOutputConditions[NUMBER_OF_OUTPUT_CHANNELS][CONDITION_MAX_CONDITION_UNITS+1+2] @".__CONFIG_DATA" =
{
    //4路负载
    {0x821B,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0800,0x0101,0x0000},//MLoad1    	1
    {0x8213,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0801,0x0101,0x0000},//MLoad2		2

    {0x821A,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0802,0x0000,0x00},//MLoad3 			4
    {0x8212,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0803,0x0000,0x00},//MLoad4 			5
    
    //{0x0000,0x8401,0xa402,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0000,0x0000,0x00},//MLoad3		3
    //{0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0000,0x0000,0x00},//MLoad4 
    
   //{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},
   //{0x0001,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x1924,0x0101,0x00},//lcd1 
    {0x8206,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0842,0x0000,0x00},//acc 			4
    {0x8209,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0843,0x0000,0x00},//on 			5
    //{0x0001,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0843,0x0000,0x00},//on 			
   
    
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0808,0x0000,0x00},//LCD1  发动机仓火警--------->ON档开关(Y_JB18->9)+仓温报警信号低电平输入    //取消
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0809,0x0000,0x00},//LCD2  
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x080a,0x0000,0x00},//LCD3  发电机充电指示2------>ON档开关(Y_JB18->9)+发电机充电指示开关
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x080b,0x0000,0x00},//LCD4  缓速器工作指示------->ON档开关(Y_JB18->9)+ 缓速器工作指示信号开关
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x080c,0x0000,0x00},//LCD5  刹车灯指示----------->ON档开关(Y_JB18->9)+ 刹车灯开关(H_JA20->3)  
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x080d,0x0000,0x00},//LCD6  变速箱故障指示------->ON档开关(Y_JB18->9)+ 变速箱故障报警开关
    {0x8200|27,0x8210,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x080e,0x0000,0x00},//LCD7  位置灯指示----------->ON档开关(Y_JB18->9)+ 位置灯开关(Y_J25->16)
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x080f,0x0000,0x00},//LCD8  空档指示------------->ON档开关(Y_JB18->9)+空档开关
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0810,0x0000,0x00},//LCD9  前进档提示----------->ON档开关(Y_JB18->9)+空档开关OFF+倒档开关OFF
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0811,0x0000,0x00},//LCD10 倒档提示------------->ON档开关(Y_JB18->9)+R档信号开关 
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0812,0x0000,0x00},//LCD11 消音状态关指示-------> 
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0813,0x0000,0x00},//LCD12 消音状态开指示------->
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0814,0x0000,0x00},//LCD13 门应急报警----------->ON档开关(Y_JB18->9)+门泵低气压报警开关
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0815,0x0000,0x00},//LCD14 干燥器指示----------->ON档开关(Y_JB18->9)+干燥器达到工作条件时输出 
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0816,0x0000,0x00},//LCD15 发动机故障指示灯----->ON档开关(Y_JB18->9)+ 发动机DM1报文(单个故障时18feca00;多个故障时：18ecff00与18ebff00同时存在)；取严重故障与轻微故障报警指示灯状态；
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0817,0x0000,0x00},//LCD16 空滤报警指示--------->ON档开关(Y_JB18->9)+空滤报警开关
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0818,0x0000,0x00},//LCD17 气压报警------------->前气压报警：ON档开关+ 前气压报警开关 后气压报警：ON档开关+后气压报警开关   前气压传感器故障  后气压传感器故障
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0819,0x0000,0x00},//LCD18 ASR故障指示---------->ON档开关(Y_JB18->9)+ ASR故障指示开关(Y_JB4->28)  
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x081a,0x0000,0x00},//LCD19 尿素液位低----------->添蓝液位报文（ID:18fe563d）；尿素液位低于20% 报警灯亮，低于10%时报警灯开始闪烁；
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x081b,0x0000,0x00},//LCD20 SCR报警指示灯-------->ON档开关(Y_JB18->9)+SCR后处理DM1报文（ID:单个故障时18feca3d;多个故障时：18ecff3d与18ebff3d同时存在） 
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x081c,0x0000,0x00},//LCD21 下客门铃请求指示----->ON档开关(Y_JB18->9)+下客门铃按钮 
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x081d,0x0000,0x00},//LCD22 OBD MIL指示灯-------->ON档开关(Y_JB18->9)+SCR后处理DM1报文（ID:单个故障时18feca3d;多个故障时：18ecff3d与18ebff3d同时存在）；取MIL指示灯状态；
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x081e,0x0000,0x00},//LCD23 冷却液水位过低报警--->ON档开关(Y_JB18->9)+低水位报警开关 
    {0x8200|27,0x822D,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x081f,0x0000,0x00},//LCD24 清小计--------------->ON档开关(Y_JB18->9)+
     
    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0820,0x0101,0x00},//led1    // ACC档指示灯->点火开关-ACC(Y_JB17->06)
    {0x8200|19,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0821,0x0101,0x00},//led1    // 轻微故障指示灯
    {0x8200|26,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0822,0x0101,0x00},//led2    // 近光灯指示->ON档开关(Y_JB18->9)+ 位置灯开关(Y_J25->16)+近光灯开关(Q_JA42->8)   OK
    {0x8200|18,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0823,0x0101,0x00},//led3    // 远光灯->ON档开关(Y_JB18->9)+ 远光开关(Q_JA41->7)+近光灯开关悬空(Q_JA42->8)

    {0x8200|25,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0824,0x0101,0x00},
	// {0x8209,0x8215,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x1C24,0x0a0a,0x00},//led4    // 左转向灯->ON档开关(Y_JB18->9)+ 左转向灯开关(Y_JA26-21)或者危急报警开关单独控制(JB14->11) 1Hz 
    {0x8200|24,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0825,0x0101,0x0310},//led5    // 水温 
    {0x8200|23,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0826,0x0101,0x00},
    {0x8200|22,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0827,0x0101,0x00},//led7    // 发动机预热
    {0x8200|16,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0828,0x0101,0x00},//led8    // 后仓门->后仓门开关悬空(H_JA41->7)
    {0x8200|21,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0829,0x0101,0x00},//led9    // MIL报警  
    {0x8200|17,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x082a,0x0101,0x00},//led10   // ASR故障->ON档开关(Y_JB18->9)+ ASR故障指示开关(Y_JB3->31)  
    {0x8200|20,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x082b,0x0101,0x00},//led11   // 油量报警灯

    {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x082c,0x0101,0x00},
	//{0x8209,0x8211,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x1C2C,0x0A0A,0x00},//led12   // 右转向灯->ON档开关(Y_JB18->9)+ 右转向灯开关(Y_JA27-17)|者危急报警开关单独控制  
    {0x8200|19,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x082d,0x0101,0x00},//led13   // 后雾灯->ON档开关(Y_JB18->9)+ 位置灯开关(Y_J25->16)+前雾灯开关(Y_JB5->0)+后雾灯开关(Y_JA28->20)
    {0x8200|26,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x082e,0x0101,0x00},//led14   // 前雾灯->ON档开关(Y_JB18->9)+ 位置灯开关(Y_J25->16)+前雾灯开关(Y_JB5->0)
    {0x8200|18,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x082f,0x0101,0x00},//led15   // 严重故障 
    
    {0x8200|25,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x1930,0x0101,0x00},//柱子报警1
    {0x8200|24,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0831,0x0101,0x00},//柱子报警2
    
    {0x8200|23,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0832,0x0101,0x00},//前门开
    {0x8200|22,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0833,0x0101,0x00},//后门开
    {0x8200|16,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0834,0x0101,0x00},//车速超速报警灯
    {0x8200|21,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0835,0x0101,0x00},//发动机转速超速报警灯 
   // {0x8200|17,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0835,0x0101,0x00},//发动机转速超速报警灯     
    {0x8200|17,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0836,0x0101,0x00},//位置灯


   {0x8200|27,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0837,0x0101,0x00},//位置灯
   {0x8200|19,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0838,0x0101,0x00},//位置灯
   {0x8200|26,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0839,0x0101,0x00},//位置灯
   {0x8200|18,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x083a,0x0101,0x00},//位置灯   
   {0x8200|25,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x083b,0x0101,0x00},//位置灯
   {0x8200|24,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x083c,0x0101,0x00},//位置灯
   
            
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0}, 
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//左转同步
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//右转同步
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//转向灯同步声音
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//ON输出
   // {0xc21b,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0844,0x0101,0x00},//前门未关
   // {0xc213,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0845,0x0101,0x00},//中门未关
   // {0xc212,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0846,0x0101,0x00},//后门未关
//////{0x8405,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0847,0x0101,0x00},//中门视频
///////{0x8213,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0848,0x0101,0x00},//倒档视频
   // {0x821b,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0849,0x0101,0x00},//画面切换
    
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//快闪
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//N档信号
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//R档信号
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//L档信号
    
 //   {0xc21b,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x084a,0x0101,0x00},//启动过长
  //  {0xc213,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x084b,0x0101,0x00},//N档未关
  //  {0xc21a,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x084c,0x0101,0x00},//重复启动
  //  {0xc212,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x084d,0x0101,0x00},//启动中
    
  //  {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//一级报警声音
   // {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//二级报警声音
    //{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//充电指示灭5s
    //{0xA206,0xA209,0xA20B,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0x0846,0x0000,0x00},//休眠与唤醒
   
   
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//
    {0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0,0,0,0,0,0,0,0,0,0,0,0,0, 0},//


};
 // unsigned long  SignelPackageID;
 // unsigned long  MultiPgckageDeclareID;
 // unsigned long  MultiPgckageDatID;
const  EngineDiagnoseCfgStruct  EngineDiagnoseCfg@".__CONFIG_DATA"= 
{
 0x0000,
 0x18feca00,
 0x18ecff00,
 0x18ebff00,
 15,
 0x00020273, //1
 0x000c0275, //0
 0x00020264,
 0x00030066,
 0x00040066,
 0x00030a3f, //5
 0x00040a3f,
 0x0002005b,
 0x00120066,
 0x0003005b,
 0x0004005b,
 0x000303ce,
 0x000403ce,
 0x00030064,
 0x00040064,
 0x00120064,
 0x0003006e,
 0x0004006e,
 0x0010006e,
 0x0000006e,
 0x00030069,
 0x00040069, 
 0x00000069,
 0x000406e1,
 0x000306e1,
};

const  EngineDiagnoseCfgStruct  EngineDiagnoseCfg1@".__CONFIG_DATA"= 
{
 0x8001,
 0x18feca00,
 0x18ecff00,
 0x18ebff00,
 15,
 0x000c0275, //0
 0x00020273, //1
 0x00020264,
 0x00030066,
 0x00040066,
 0x00030a3f, //5
 0x00040a3f,
 0x0002005b,
 0x00120066,
 0x0003005b,
 0x0004005b,
 0x000303ce,
 0x000403ce,
 0x00030064,
 0x00040064,
 0x00120064,
 0x0003006e,
 0x0004006e,
 0x0010006e,
 0x0000006e,
 0x00030069,
 0x00040069, 
 0x00000069,
 0x000406e1,
 0x000306e1,
};  

const  EngineDiagnoseCfgStruct  EngineDiagnoseCfg2@".__CONFIG_DATA"= 
{
 0x8001,
 0x18feca00,
 0x18ecff00,
 0x18ebff00,
 15,
 0x000c0275, //0
 0x00020273, //1
 0x00020264,
 0x00030066,
 0x00040066,
 0x00030a3f, //5
 0x00040a3f,
 0x0002005b,
 0x00120066,
 0x0003005b,
 0x0004005b,
 0x000303ce,
 0x000403ce,
 0x00030064,
 0x00040064,
 0x00120064,
 0x0003006e,
 0x0004006e,
 0x0010006e,
 0x0000006e,
 0x00030069,
 0x00040069, 
 0x00000069,
 0x000406e1,
 0x000306e1,
};  

const  StorageManager1_struct StorageManagerCONST[RESOURE_TOTAL] @".__CONFIG_DATA"= 
	{
		{0x80,0x00,0x04,11},{0x00,0x00,0x00,0x00},{0x00,0x00,0x00,0x00},
		{0x00,0x00,0x00,0x00},{0x00,0x00,0x00,0x00},{0x00,0x00,0x00,0x00},
		{0x00,0x00,0x00,0x00},{0x00,0x00,0x00,0x00},{0x00,0x00,0x00,0x00},
		{0x00,0x00,0x00,0x00},
	};
const  StorageManager2_struct InformationCONST[SECOND_CFG_TOTAL] @".__CONFIG_DATA"= 
	{
		{0X03,0X2000,0,0Xff},	//获得时间
		{0X03,0X3000,33,0Xff},
		{0X02,0x00C2,66,0Xff},//j1939
		{0X02,0X00C3,88,0xff},//
	};



//#pragma CONST_SEG __GPAGE_SEG CONST_DATA_ROM 
 const  PC_CONFIG_ADDRESS_STRUCT  PcConfigAddress[30] @".__PCADDCONFIG_DATA"=
 { 
   {"SysConfigData		",(UINT32)(&SysConfigData),(UINT16)sizeof(SysConfigData),0x0000},
   {"UserKeyConfig		",(UINT32)(&UserKeyConfig),(UINT16)sizeof(UserKeyConfig),0x0000},
   {"OpenShortMask		",(UINT32)(&OpenShortMask),		2,							 0x0000},
   {"InsideBitAttrConfig",(UINT32)(&Inside16BitAttrConfig),(UINT16)sizeof(Inside16BitAttrConfig),0x0000},
   {"SENSOR_DATA_CONFIG ",(UINT32)(&SENSOR_DATA_CONFIG),(UINT16)sizeof(SENSOR_DATA_CONFIG),0x0000},
   {"VIRTUAL_KEY_CONFIG ",(UINT32)(&SENSOR_VIRTUAL_KEY_CONFIG),(UINT16)sizeof(SENSOR_VIRTUAL_KEY_CONFIG),0x0000},
   {"J1939_Number_Config",(UINT32)(&J1939_Number_Config),(UINT16)sizeof(J1939_Number_Config),0x0000},
   {"J1939FindIndexConfig",(UINT32)(J1939FindIndexConfig),(UINT16)sizeof(J1939FindIndexConfig),0x0000},
   {"J1939IndexConfig	",(UINT32)(J1939IndexConfig),(UINT16)sizeof(J1939IndexConfig),0x0000},
   {"J1939WordDataConfig",(UINT32)(J1939WordDataConfig),(UINT16)sizeof(J1939WordDataConfig),0x0000},
   {"StatusPrara		",(UINT32)(StatusPrara),(UINT16)sizeof(StatusPrara),0x0000},
   {"MotorStepPrm		",(UINT32)(MotorStepPrm),(UINT16)sizeof(MotorStepPrm),0x0000},
   {"ModuleDiagnose 	",(UINT32)(&ModuleDiagnose),(UINT16)sizeof(ModuleDiagnose),0x0000},
   {"IcoWarnConfig		",(UINT32)(&IcoWarnConfig),(UINT16)sizeof(IcoWarnConfig),0x0100},//L:版本0x0001，大小端的问题在这边反
   {"J1939ZFFindIndexCfg",(UINT32)(J1939ZFFindIndexConfig),(UINT16)sizeof(J1939ZFFindIndexConfig),0x0000},
   {"J1939ZFDataConfig	",(UINT32)(&J1939ZFDataConfig),(UINT16)sizeof(J1939ZFDataConfig),0x0000},
   {"LoadOutputConditions",(UINT32)(LoadOutputConditions),(UINT16)sizeof(LoadOutputConditions),0x0100}, 
   {"EngineDiagnoseCfg	",(UINT32)(&EngineDiagnoseCfg),(UINT16)sizeof(EngineDiagnoseCfg),0x0000},
   {"EngineDiagnoseCfg1 ",(UINT32)(&EngineDiagnoseCfg1),(UINT16)sizeof(EngineDiagnoseCfg1),0x0000},
   {"EngineDiagnoseCfg2 ",(UINT32)(&EngineDiagnoseCfg2),(UINT16)sizeof(EngineDiagnoseCfg2),0x0000},
   {"StorageManagerCONST",(UINT32)(StorageManagerCONST),(UINT16)sizeof(StorageManagerCONST),0x0000},
   {"InformationCONST	",(UINT32)(InformationCONST),(UINT16)sizeof(InformationCONST),0x0000},
   {"PicInfo			",(UINT32)(PicInfo),(UINT16)sizeof(PicInfo),0x0000},
   {"InterfaceInfo		",(UINT32)(InterfaceInfo),(UINT16)sizeof(InterfaceInfo),0x0000},
   {"PicLogicInfo		",(UINT32)(PicLogicInfo),(UINT16)sizeof(PicLogicInfo),0x0000},
   {"OsdLoicgInfo		",(UINT32)(OsdLoicgInfo),(UINT16)sizeof(OsdLoicgInfo),0x0000},
   {"OsdLoicgInfo1		",(UINT32)(OsdLoicgInfo1),(UINT16)sizeof(OsdLoicgInfo1),0x0000},
 //{"PicInfo	   ",(UINT32)(IcoWarnConfig),(UINT16)sizeof(IcoWarnConfig),0x0000},
 //{"PicInfo	   ",(UINT32)(IcoWarnConfig),(UINT16)sizeof(IcoWarnConfig),0x0000},
 //{"PicInfo	   ",(UINT32)(IcoWarnConfig),(UINT16)sizeof(IcoWarnConfig),0x0000},
 };

 /*
   (0xE08000) ------------->      780000
   (0xE18000) ------------->      784000
   (0xE28000) ------------->      788000
   (0xE38000) ------------->      78c000
   (0xE48000) ------------->      790000
   (0xE50000) ------------->      794000
   (0xE60000) ------------->      798000
   (0xE70000) ------------->      79c000
   (0xE80000) ------------->      7A0000
   (0xE90000) ------------->      7A4000
   (0xEA0000) ------------->      7A8000
   (0xEB0000) ------------->      7AC000
   (0xEC0000) ------------->      7B0000
   (0xED0000) ------------->      7B4000
   (0xEE0000) ------------->      7B8000
   (0xEF0000) ------------->      7BC000
   (0xF00000) ------------->      7C0000
   (0xF10000) ------------->      7C4000
   (0xF20000) ------------->      7C8000
   (0xF30000) ------------->      7CC000

int LineAdrrGotoLogcAdrr(int addr)
{
  int LineAdrr;
  int page;
  int offset;
  page = (addr - 0x780000)/0x4000 + 0xE0;
  offset = (addr - 0x780000)%0x4000;
  LineAdrr = (page<<16)+0x8000+offset;
  return LineAdrr;
}
 */

//#pragma CONST_SEG    DEFAULT
